In [4]:
#dependencies

import pandas as pd

In [5]:
#Use Pandas to read data
age_data = pd.read_csv("../Resources/Age_Data.csv")

In [6]:
#print to view
age_data.head()

   Unnamed: 0  Year        City        Age Range  Number in Range
0           0  2018  Albany, NY   18 to 24 Years            21091
1           1  2018  Albany, NY  75 Years & Over             5906
2           2  2018  Albany, NY   45 to 54 Years            10514
3           3  2018  Albany, NY    Under 5 Years             5491
4           4  2018  Albany, NY   65 to 74 Years             6670

In [7]:
#look for missing values
#awesome to see!
age_data.count()

Unnamed: 0         16236
Year               16236
City               16236
Age Range          16236
Number in Range    16236
dtype: int64

In [8]:
#get a list of all of our columns for easy reference
age_data.columns

Index(['Unnamed: 0', 'Year', 'City', 'Age Range', 'Number in Range'], dtype='object')

In [9]:
#collect data that includes year 2016 & age of 25-34
#'Year' = 2016
#'Age Range' = 25 t0 34 Years

age_data_2016_df = age_data.loc[(age_data["Year"] == 2016) & (age_data["Age Range"] == "25 to 34 Years")]

In [10]:
#print
age_data_2016_df.head()

     Unnamed: 0  Year        City       Age Range  Number in Range
32           32  2016  Albany, NY  25 to 34 Years            16205
98           98  2016  Albany, NY  25 to 34 Years            16205
164         164  2016  Albany, NY  25 to 34 Years            16205
230         230  2016  Albany, NY  25 to 34 Years            16205
296         296  2016  Albany, NY  25 to 34 Years            16205

In [11]:
#drop column "Unnamed: 0"
#add at end inplace=True -> to allow panda to edit the original DF
age_data_2016_df.drop(columns=["Unnamed: 0"], inplace=True)

In [12]:
#drop duplicates!
#missed the first time
#use city as subset - since it varies
#add at end inplace=True -> to allow panda to edit the original DF
#inplace=False -> does not affect the original DF
age_data_2016_df.drop_duplicates(subset="City", keep="first", inplace=True)

In [13]:
#print
age_data_2016_df

       Year                             City       Age Range  Number in Range
32     2016                       Albany, NY  25 to 34 Years            16205
428    2016                      Atlanta, GA  25 to 34 Years           101787
1220   2016                   Boise City, ID  25 to 34 Years            33822
1616   2016                       Boston, MA  25 to 34 Years           163811
2012   2016                      Buffalo, NY  25 to 34 Years            45118
2408   2016                    Charlotte, NC  25 to 34 Years           149024
2804   2016                      Chicago, IL  25 to 34 Years           532349
3200   2016                   Cincinnati, OH  25 to 34 Years            54754
3596   2016                     Columbus, OH  25 to 34 Years           180685
3992   2016                       Dallas, TX  25 to 34 Years           243721
4388   2016                       Denver, CO  25 to 34 Years           156779
4784   2016                      Detroit, MI  25 to 34 Years           101246
5180   2016                 Grand Rapids, MI  25 to 34 Years            36962
5576   2016                   Harrisburg, PA  25 to 34 Years             8406
5972   2016                     Hartford, CT  25 to 34 Years            20263
6368   2016                      Houston, TX  25 to 34 Years           414304
6764   2016  Indianapolis city (balance), IN  25 to 34 Years           143328
7160   2016                 Jacksonville, FL  25 to 34 Years           144849
7556   2016                    Las Vegas, NV  25 to 34 Years            84756
7952   2016                  Los Angeles, CA  25 to 34 Years           708811
8348   2016                        Miami, FL  25 to 34 Years            74135
8744   2016                    Nashville, NC  25 to 34 Years              474
9140   2016                  New Orleans, LA  25 to 34 Years            73170
9536   2016                     New York, NY  25 to 34 Years          1532884
9932   2016                      Orlando, FL  25 to 34 Years            63947
10328  2016                 Philadelphia, PA  25 to 34 Years           295799
10724  2016                      Phoenix, AZ  25 to 34 Years           251243
11120  2016                   Pittsburgh, PA  25 to 34 Years            62515
11516  2016                     Portland, OR  25 to 34 Years           127557
11912  2016                      Raleigh, NC  25 to 34 Years            85608
12308  2016                     Richmond, VA  25 to 34 Years            44020
12704  2016                      Roanoke, VA  25 to 34 Years            15265
13100  2016                   Sacramento, CA  25 to 34 Years            92883
13496  2016                    San Diego, CA  25 to 34 Years           264385
13892  2016                San Francisco, CA  25 to 34 Years           203463
14288  2016                      Seattle, WA  25 to 34 Years           160215
14684  2016                      Spokane, WA  25 to 34 Years            33479
15080  2016                    St. Louis, MO  25 to 34 Years            61779
15476  2016                     Syracuse, NY  25 to 34 Years            23202
15872  2016                        Tampa, FL  25 to 34 Years            61411

In [15]:
#export DF into a .csv
age_data_2016_df.to_csv("2016_all_cities_age_data.csv")